app/controllers/admin/posts_controller.rb

  def index
    @posts = Post.paginate :page => params[:page], :per_page => 5
---
SELECT * FROM `posts` LIMIT 0, 5
SELECT count(*) AS count_all FROM `posts`

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-03-28 17:19:23', 'Our title', 'Our body', '2009-03-28 17:19:23')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `body` = 'Our body edited', `updated_at` = '2009-03-28 17:30:48' WHERE `id` = 2