app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments` WHERE (`comments`.post_id = 1)

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))

  def create
    @comment = Comment.new([params[:post], params[:comment]])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`updated_at`, `body`, `post_id`, `created_at`) VALUES('2009-03-28 16:32:54', 'My comment\r\n', 1, '2009-03-28 16:32:54')

  def load_post
    @post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)