app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-03-28 15:43:50', 'My new blog post', 'This is an exciting post from me!', '2009-03-28 15:43:50')